OpenFOAM-7/chapter8/coFlowFlame2D/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    chemistrySolver   ode;
    //chemistryThermo   psi;
}

chemistry           on;

initialChemicalTimeStep 1e-07;

sequentialCoeffs
{
    cTauChem        0.001;
}

EulerImplicitCoeffs
{
    cTauChem        0.05;
    equilibriumRateLimiter off;
}

odeCoeffs
{
     /*solver          SIBS;
     eps             1e-4;
     scale           1;*/
     solver          Trapezoid;
     absTol          1e-8;
     relTol          1e-1;
}
/*
13
(
Euler
EulerSI
RKCK45
RKDP45
RKF45
Rosenbrock12
Rosenbrock23
Rosenbrock34
SIBS
Trapezoid
rodas23
rodas34
seulex
)

*/


// ************************************************************************* //
