OpenFOAM-7/chapter8/coFlowFlame2D/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    fuel
    {
        type            calculated;
        value           uniform 0;
    }
    air
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    axis
    {
        type            symmetryPlane;
    }
    wallUp
    {
        type       compressible::alphatWallFunction;
        Prt        0.85;
        value      uniform 0;
    }
    "(front-1|front-2)"
    {
        type            wedge;
    }
    "(back-1|back-2)"
    {
        type            wedge;
    }
}


// ************************************************************************* //
